from math import pi #импортировал из библиотеки число пи 
a = (input()) #происходит ввод текста
print('Добрый день,',a,'!', 'введите радиус круга в сантиметрах ')#ввел дружеское приветствие пользователю
r = (input())#ввод радиуса окружности 
c = 2 * pi* float(b) #ищу по формуле длину окружности в см
d = (float(b)**2)*pi #ищу по формуле площадь круга в см
print('длина окружности в см',c) #вывод результата 
print('площадь круга в см',d) #вывод результата
g = d / 1000 #перевод из см в метры 
print('площадь круга в м',d) #вывод результата




